"""
1. В базе данных shop и sample присутствуют одни и те же таблицы, учебной базы данных. 
Переместите запись id = 1 из таблицы shop.users в таблицу sample.users. 
Используйте транзакции.
"""
USE `shop`;

INSERT INTO `users` (`name`, `birthday_at`) 
VALUES ('Мыш', '2020-11-13'), ('Пек', '2019-04-10'), ('Илья', '1991-06-07'), ('Алина', '2000-08-25');

USE `example`;

Database changed
START TRANSACTION;

REPLACE INTO `users` SELECT * FROM `shop`.`users` WHERE `id` = 1;

SELECT * FROM `users`;
+----+--------------------+-------------+---------------------+---------------------+
| id | name               | birthday_at | created_at          | updated_at          |
+----+--------------------+-------------+---------------------+---------------------+
|  1 | Мыш                | 2020-11-13  | 2020-12-28 17:45:15 | 2020-12-28 17:45:15 |
|  2 | Наталья            | 1984-11-12  | 2020-12-28 16:30:23 | 2020-12-28 16:30:23 |
|  3 | Александр          | 1985-05-20  | 2020-12-28 16:30:23 | 2020-12-28 16:30:23 |
|  4 | Сергей             | 1988-02-14  | 2020-12-28 16:30:23 | 2020-12-28 16:30:23 |
|  5 | Иван               | 1998-01-12  | 2020-12-28 16:30:23 | 2020-12-28 16:30:23 |
|  6 | Мария              | 1992-08-29  | 2020-12-28 16:30:23 | 2020-12-28 16:30:23 |
+----+--------------------+-------------+---------------------+---------------------+
6 rows in set (0.00 sec)

SELECT * FROM `shop`.`users`;
+----+------------+-------------+---------------------+---------------------+
| id | name       | birthday_at | created_at          | updated_at          |
+----+------------+-------------+---------------------+---------------------+
|  2 | Пек        | 2019-04-10  | 2020-12-28 17:45:15 | 2020-12-28 17:45:15 |
|  3 | Илья       | 1991-06-07  | 2020-12-28 17:45:15 | 2020-12-28 17:45:15 |
|  4 | Алина      | 2000-08-25  | 2020-12-28 17:45:15 | 2020-12-28 17:45:15 |
+----+------------+-------------+---------------------+---------------------+
3 rows in set (0.00 sec)


"""
2. Создайте представление, которое выводит название name товарной позиции из таблицы products
и соответствующее название каталога name из таблицы catalogs.
"""

CREATE OR REPLACE VIEW `prod_cat`(`product_id`, `product_name`, `catalog_name`) AS 
  SELECT `p`.`id` AS `product_id`, `p`.`name`, `c`.`name` 
  FROM `products` AS `p` 
LEFT JOIN
  `catalogs` AS `c`
   ON `p`.`catalog_id` = `c`.`id`;

SELECT * FROM prod_cat;
+------------+-------------------------+-----------------------------------+
| product_id | product_name            | catalog_name                      |
+------------+-------------------------+-----------------------------------+
|          1 | Intel Core i3-8100      | Процессоры                        |
|          2 | Intel Core i5-7400      | Процессоры                        |
|          3 | AMD FX-8320E            | Процессоры                        |
|          4 | AMD FX-8320             | Процессоры                        |
|          5 | ASUS ROG MAXIMUS X HERO | Материнские платы                 |
|          6 | Gigabyte H310M S2H      | Материнские платы                 |
|          7 | MSI B250M GAMING PRO    | Материнские платы                 |
+------------+-------------------------+-----------------------------------+
7 rows in set (0.01 sec)
